OpenFOAM_6/tutorials/lagrangian/coalChemistryFoam/simplifiedSiwek/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

source1
{
    type            fixedTemperatureConstraint;

    timeStart       0.1;
    duration        0.4;
    selectionMode   cellSet;
    cellSet         ignitionCells;

    mode            uniform;
    temperature     2000;
}


// ************************************************************************* //
